tests/stripe-messages/subscription.json

{
    "id": "evt_1KVmllLEJyfuWvBBKJLGjjNS",
    "object": "event",
    "api_version": "2020-03-02",
    "created": 1645491741,
    "type": "customer.subscription.created",
    "data": {
        "object": {
            "id": "sub_1KWk4FLEJyfuWvBBo0KiBVVh",
            "object": "subscription",
            "application_fee_percent": null,
            "automatic_tax": {
                "enabled": false
            },
            "billing_cycle_anchor": 1645719683,
            "billing_thresholds": null,
            "cancel_at": null,
            "cancel_at_period_end": false,
            "canceled_at": null,
            "collection_method": "charge_automatically",
            "created": 1645719683,
            "current_period_end": 1648138883,
            "current_period_start": 1645719683,
            "customer": "cus_LD7zwpdUCGRURW",
            "days_until_due": null,
            "default_payment_method": null,
            "default_source": null,
            "default_tax_rates": [],
            "discount": null,
            "ended_at": null,
            "items": {
                "object": "list",
                "data": [
                    {
                        "id": "si_LDAPJbfVadgZ2x",
                        "object": "subscription_item",
                        "billing_thresholds": null,
                        "created": 1645719684,
                        "metadata": {},
                        "plan": {
                            "id": "price_1KWk4FLEJyfuWvBB540Bj6Ro",
                            "object": "plan",
                            "active": false,
                            "aggregate_usage": null,
                            "amount": 200,
                            "amount_decimal": "200",
                            "billing_scheme": "per_unit",
                            "created": 1645719683,
                            "currency": "eur",
                            "interval": "month",
                            "interval_count": 1,
                            "livemode": false,
                            "metadata": {},
                            "nickname": null,
                            "product": "prod_JjiIPD7pifRJMk",
                            "tiers": null,
                            "tiers_mode": null,
                            "transform_usage": null,
                            "trial_period_days": null,
                            "usage_type": "licensed"
                        },
                        "price": {
                            "id": "price_1KWk4FLEJyfuWvBB540Bj6Ro",
                            "object": "price",
                            "active": false,
                            "billing_scheme": "per_unit",
                            "created": 1645719683,
                            "currency": "eur",
                            "livemode": false,
                            "lookup_key": null,
                            "metadata": {},
                            "nickname": null,
                            "product": "prod_JjiIPD7pifRJMk",
                            "recurring": {
                                "aggregate_usage": null,
                                "interval": "month",
                                "interval_count": 1,
                                "trial_period_days": null,
                                "usage_type": "licensed"
                            },
                            "tax_behavior": "unspecified",
                            "tiers_mode": null,
                            "transform_quantity": null,
                            "type": "recurring",
                            "unit_amount": 200,
                            "unit_amount_decimal": "200"
                        },
                        "quantity": 1,
                        "subscription": "sub_1KWk4FLEJyfuWvBBo0KiBVVh",
                        "tax_rates": []
                    }
                ],
                "has_more": false,
                "total_count": 1,
                "url": "/v1/subscription_items?subscription=sub_1KWk4FLEJyfuWvBBo0KiBVVh"
            },
            "latest_invoice": "in_1KWk4FLEJyfuWvBBDpZLM9yT",
            "livemode": false,
            "metadata": {},
            "next_pending_invoice_item_invoice": null,
            "pause_collection": null,
            "payment_settings": {
                "payment_method_options": null,
                "payment_method_types": null
            },
            "pending_invoice_item_interval": null,
            "pending_setup_intent": null,
            "pending_update": null,
            "plan": {
                "id": "price_1KWk4FLEJyfuWvBB540Bj6Ro",
                "object": "plan",
                "active": false,
                "aggregate_usage": null,
                "amount": 200,
                "amount_decimal": "200",
                "billing_scheme": "per_unit",
                "created": 1645719683,
                "currency": "eur",
                "interval": "month",
                "interval_count": 1,
                "livemode": false,
                "metadata": {},
                "nickname": null,
                "product": "prod_JjiIPD7pifRJMk",
                "tiers": null,
                "tiers_mode": null,
                "transform_usage": null,
                "trial_period_days": null,
                "usage_type": "licensed"
            },
            "quantity": 1,
            "schedule": null,
            "start_date": 1645719683,
            "status": "incomplete",
            "tax_percent": null,
            "transfer_data": null,
            "trial_end": null,
            "trial_start": null
        }
    }
}